---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD\PS_DiD_Calv
> o_Ibañez_Nuñez_Soto_P2-2023-06-30_1.log
  log type:  text
 opened on:  30 Jun 2023, 19:05:42
.         local today "`c(current_time)'"
.         local curdir "`c(pwd)'"
.         local newn = c(N) + 1
. }

. /*******************************************************************************
> Problem 2 - Respuestas
> *******************************************************************************/
. {
. use "$bd\eitc.dta", clear
. * 1. Create a table summarizing all the data provided in the data set.
. des

Contains data from D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD\eitc.
> dta
  obs:        13,746                          
 vars:            11                          10 Apr 2006 15:37
---------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------
state           float   %9.0g                 State of Residence
year            float   %9.0g                 Year [taxyear]
urate           float   %9.0g                 State Unemp Rate
children        byte    %8.0g                 Number of Children
nonwhite        byte    %8.0g                 Dummy=1 if Hispanic/Black
finc            double  %10.0g                Annual Family Income (97$)
earn            double  %10.0g                Annual earnings (97$)
age             byte    %8.0g                 Age of woman
ed              byte    %8.0g                 Years of education
work            byte    %8.0g                 Dummy =1 if Employed last year
unearn          double  %10.0g                Unearned Income (97$)
---------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |     13,746    54.52459    27.13489         11         95
        year |     13,746    1993.347    1.703207       1991       1996
       urate |     13,746    6.761734    1.462464        2.6       11.4
    children |     13,746    1.192638    1.382105          0          9
    nonwhite |     13,746    .6006838    .4897757          0          1
-------------+---------------------------------------------------------
        finc |     13,746    15255.32    19444.25          0   575616.8
        earn |     13,746    10432.48    18200.76          0   537880.6
         age |     13,746    35.20966    10.15713         20         54
          ed |     13,746    8.806053    2.635639          0         11
        work |     13,746     .513022    .4998486          0          1
-------------+---------------------------------------------------------
      unearn |     13,746    4.822844    7.122624          0   134.0575
. 
. * 2. Calculate the sample means of all variables for (a) single women with no children, (b) single women with 1 child, and (c) single
>  women with 2+ children
. summarize if children==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      5,927    53.39666    26.40429         11         95
        year |      5,927    1993.365    1.700611       1991       1996
       urate |      5,927    6.663067    1.480953        2.6       11.4
    children |      5,927           0           0          0          0
    nonwhite |      5,927     .515944    .4997879          0          1
-------------+---------------------------------------------------------
        finc |      5,927    18559.86    23041.78          0   575616.8
        earn |      5,927    13760.26     21301.4          0   537880.6
         age |      5,927    38.49823    11.04638         20         54
          ed |      5,927    8.548676    2.888691          0         11
        work |      5,927    .5744896    .4944619          0          1
-------------+---------------------------------------------------------
      unearn |      5,927    4.799607    8.495665          0   134.0575
. summarize if children == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      3,058    55.59091    27.33653         11         95
        year |      3,058    1993.338    1.717959       1991       1996
       urate |      3,058     6.80206    1.449963        2.6       11.4
    children |      3,058           1           0          1          1
    nonwhite |      3,058    .5964683    .4906859          0          1
-------------+---------------------------------------------------------
        finc |      3,058    13941.57    18551.76          0   410507.6
        earn |      3,058    9928.279    17536.87          0   366095.5
         age |      3,058    33.75899    9.901038         20         54
          ed |      3,058    8.992479    2.396625          0         11
        work |      3,058    .5376063    .4986653          0          1
-------------+---------------------------------------------------------
      unearn |      3,058    4.013291    5.735145          0   102.9579
. summarize if children >=2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      4,761    55.24386    27.84643         11         95
        year |      4,761     1993.33    1.697045       1991       1996
       urate |      4,761    6.858664    1.439712        2.6       11.4
    children |      4,761    2.801092    1.064578          2          9
    nonwhite |      4,761    .7088847    .4543243          0          1
-------------+---------------------------------------------------------
        finc |      4,761     11985.3    13576.81          0   231489.5
        earn |      4,761    6613.547    12869.32          0   162443.6
         age |      4,761    32.04747    7.629929         20         54
          ed |      4,761    9.006721    2.415887          0         11
        work |      4,761    .4207099    .4937249          0          1
-------------+---------------------------------------------------------
      unearn |      4,761    5.371749    5.898279          0   81.29683
. 
. * 3. Construct a variable for the “treatment” called anykids (indicator for 1 or more kids) and a variable for time being after the e
> xpansion (called post93—should be 1 for 1994 and later)
. gen anykids = (children >= 1)
. gen post93 = (year >= 1994)
. 
. * 4. Using the “interaction term” diff-in-diff specification, run a regression to estimate the difference-in-differences estimate of 
> the effect of the EITC program on earnings. Use all women with children as the treatment group.
. gen inter = post93*anykids
. reg work post93 anykids inter, robust

Linear regression                               Number of obs     =     13,746
                                                F(3, 13742)       =      58.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0126
                                                Root MSE          =     .49674

------------------------------------------------------------------------------
             |               Robust
        work |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      post93 |  -.0020735   .0128732    -0.16   0.872    -.0273068    .0231598
     anykids |  -.1294979    .011648   -11.12   0.000    -.1523296   -.1066662
       inter |   .0468731   .0171435     2.73   0.006     .0132695    .0804768
       _cons |   .5754597   .0088024    65.38   0.000     .5582059    .5927136
------------------------------------------------------------------------------
. 
. * 5. Repeat (iv), but now include state and year fixed effects [Hint: state fixed effects, are included when we include a dummy varia
> ble for each state]. Do you get similar estimated treatment effects compared to (iv)?
. 
. egen dummy_state = group(state)
. tabulate state, generate(dummy_)

   State of |
  Residence |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |         76        0.55        0.55
         12 |         70        0.51        1.06
         13 |         52        0.38        1.44
         14 |        374        2.72        4.16
         15 |        146        1.06        5.22
         16 |        104        0.76        5.98
         21 |      1,620       11.79       17.77
         22 |        504        3.67       21.43
         23 |        412        3.00       24.43
         31 |        428        3.11       27.54
         32 |        121        0.88       28.42
         33 |        597        4.34       32.77
         34 |        463        3.37       36.13
         35 |        128        0.93       37.07
         41 |         71        0.52       37.58
         42 |         76        0.55       38.13
         43 |        136        0.99       39.12
         44 |         67        0.49       39.61
         45 |        103        0.75       40.36
         46 |         77        0.56       40.92
         47 |         85        0.62       41.54
         51 |         99        0.72       42.26
         52 |        131        0.95       43.21
         53 |        266        1.94       45.15
         54 |        164        1.19       46.34
         55 |        162        1.18       47.52
         56 |        435        3.16       50.68
         57 |        205        1.49       52.18
         58 |        219        1.59       53.77
         59 |        718        5.22       58.99
         61 |        164        1.19       60.18
         62 |        187        1.36       61.55
         63 |        178        1.29       62.84
         64 |        263        1.91       64.75
         71 |        126        0.92       65.67
         72 |        229        1.67       67.34
         73 |        133        0.97       68.30
         74 |        906        6.59       74.89
         81 |         72        0.52       75.42
         82 |         95        0.69       76.11
         83 |         51        0.37       76.48
         84 |        119        0.87       77.35
         85 |        265        1.93       79.27
         86 |        204        1.48       80.76
         87 |         69        0.50       81.26
         88 |        146        1.06       82.32
         91 |         87        0.63       82.96
         92 |        120        0.87       83.83
         93 |      2,086       15.18       99.00
         94 |         71        0.52       99.52
         95 |         66        0.48      100.00
------------+-----------------------------------
      Total |     13,746      100.00
. 
. reg work post93 anykids inter dummy_2-dummy_51 , robust

Linear regression                               Number of obs     =     13,746
                                                F(53, 13692)      =      12.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0424
                                                Root MSE          =     .49007

------------------------------------------------------------------------------
             |               Robust
        work |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      post93 |   .0001742   .0128112     0.01   0.989    -.0249375    .0252859
     anykids |  -.1238851   .0115513   -10.72   0.000    -.1465272   -.1012429
       inter |   .0457252   .0169658     2.70   0.007     .0124698    .0789806
     dummy_2 |   .1219913   .0824856     1.48   0.139    -.0396917    .2836743
     dummy_3 |   .1751252   .0896414     1.95   0.051    -.0005842    .3508345
     dummy_4 |   .0012851   .0617577     0.02   0.983    -.1197684    .1223386
     dummy_5 |   .1622958   .0695435     2.33   0.020      .025981    .2986106
     dummy_6 |   .1897963   .0738407     2.57   0.010     .0450583    .3345343
     dummy_7 |  -.0403088   .0576559    -0.70   0.484    -.1533223    .0727048
     dummy_8 |   .0966211   .0605285     1.60   0.110    -.0220229    .2152652
     dummy_9 |    .003229   .0613656     0.05   0.958    -.1170561     .123514
    dummy_10 |   .0907726   .0614103     1.48   0.139    -.0295999    .2111452
    dummy_11 |   .2011189   .0713386     2.82   0.005     .0612855    .3409523
    dummy_12 |   .0636767   .0599536     1.06   0.288    -.0538406    .1811941
    dummy_13 |   .0810073    .061021     1.33   0.184    -.0386023    .2006169
    dummy_14 |   .2451978   .0699421     3.51   0.000     .1081017     .382294
    dummy_15 |   .1012566   .0814272     1.24   0.214    -.0583518     .260865
    dummy_16 |   .3363212   .0750538     4.48   0.000     .1892054     .483437
    dummy_17 |   .1340104   .0705182     1.90   0.057     -.004215    .2722357
    dummy_18 |   .1057256   .0827545     1.28   0.201    -.0564845    .2679357
    dummy_19 |    .225731   .0741458     3.04   0.002     .0803951    .3710669
    dummy_20 |   .2383577   .0783107     3.04   0.002      .084858    .3918574
    dummy_21 |   .2516458   .0768586     3.27   0.001     .1009925    .4022991
    dummy_22 |   .2030287   .0747593     2.72   0.007     .0564902    .3495672
    dummy_23 |   .0907252   .0709261     1.28   0.201    -.0482997      .22975
    dummy_24 |   .1398258   .0638553     2.19   0.029     .0146606    .2649909
    dummy_25 |   .2375489    .067423     3.52   0.000     .1053905    .3697074
    dummy_26 |  -.0073378    .068504    -0.11   0.915     -.141615    .1269394
    dummy_27 |   .2709555   .0605632     4.47   0.000     .1522433    .3896678
    dummy_28 |   .1040988   .0663831     1.57   0.117    -.0260212    .2342189
    dummy_29 |   .1362592   .0656759     2.07   0.038     .0075254     .264993
    dummy_30 |   .1527629   .0593831     2.57   0.010     .0363638     .269162
    dummy_31 |   .0266435   .0683529     0.39   0.697    -.1073375    .1606245
    dummy_32 |   .0800413   .0673769     1.19   0.235    -.0520267    .2121092
    dummy_33 |   .0190599   .0679543     0.28   0.779    -.1141398    .1522596
    dummy_34 |   .1200377   .0644135     1.86   0.062    -.0062217    .2462971
    dummy_35 |    .198747   .0711055     2.80   0.005     .0593705    .3381235
    dummy_36 |  -.0291671   .0648343    -0.45   0.653    -.1562512    .0979171
    dummy_37 |   .1193752   .0717261     1.66   0.096    -.0212179    .2599682
    dummy_38 |   .1885394   .0587343     3.21   0.001     .0734121    .3036667
    dummy_39 |   .1403946   .0817431     1.72   0.086    -.0198332    .3006224
    dummy_40 |   .2105843   .0758233     2.78   0.005     .0619602    .3592083
    dummy_41 |   .1541107   .0898163     1.72   0.086    -.0219416    .3301629
    dummy_42 |   .1801365   .0719134     2.50   0.012     .0391763    .3210966
    dummy_43 |   .0873227   .0642084     1.36   0.174    -.0385346    .2131801
    dummy_44 |   .1479371   .0661774     2.24   0.025     .0182202     .277654
    dummy_45 |   .1101132   .0821938     1.34   0.180     -.050998    .2712244
    dummy_46 |    .293131   .0676443     4.33   0.000     .1605389    .4257231
    dummy_47 |   .1688695   .0774148     2.18   0.029     .0171259    .3206132
    dummy_48 |    .195779   .0715367     2.74   0.006     .0555572    .3360008
    dummy_49 |   .1197551    .057469     2.08   0.037      .007108    .2324021
    dummy_50 |   .1711545   .0813877     2.10   0.035     .0116234    .3306857
    dummy_51 |    .088813   .0824527     1.08   0.281    -.0728057    .2504316
       _cons |   .4659263   .0568203     8.20   0.000     .3545506    .5773019
------------------------------------------------------------------------------
. 
. /*The result is very similar to (iv) 
> iv      = 0.0468731 and significative
> v       = 0.0457252 and significative */
. 
. * 6. Using the specification from (v), re-estimate this model including urate nonwhite age ed unearn, as well as state and year FEs a
> s controls. Do you get similar estimated treatment effects compared to (v)?
. 
. egen dummy_year = group(year)
. tabulate year, generate(year_)

       Year |
  [taxyear] |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |      2,610       18.99       18.99
       1992 |      2,449       17.82       36.80
       1993 |      2,342       17.04       53.84
       1994 |      2,255       16.40       70.25
       1995 |      2,085       15.17       85.41
       1996 |      2,005       14.59      100.00
------------+-----------------------------------
      Total |     13,746      100.00
. 
. reg work post93 anykids inter urate nonwhite age ed unearn dummy_2-dummy_51 year_2-year_6, robust
note: year_5 omitted because of collinearity

Linear regression                               Number of obs     =     13,746
                                                F(62, 13683)      =      20.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1156
                                                Root MSE          =     .47114

------------------------------------------------------------------------------
             |               Robust
        work |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      post93 |   .0018969   .0188252     0.10   0.920    -.0350032    .0387969
     anykids |  -.1060565   .0115347    -9.19   0.000    -.1286661   -.0834469
       inter |   .0525387   .0163192     3.22   0.001     .0205508    .0845265
       urate |   .0047076   .0073598     0.64   0.522    -.0097186    .0191338
    nonwhite |  -.0805929   .0097478    -8.27   0.000    -.0996999    -.061486
         age |   .0033062   .0004324     7.65   0.000     .0024586    .0041538
          ed |   .0155533   .0016217     9.59   0.000     .0123744    .0187321
      unearn |  -.0174297   .0011037   -15.79   0.000    -.0195932   -.0152662
     dummy_2 |   .0995935   .0769727     1.29   0.196    -.0512834    .2504705
     dummy_3 |   .1660852   .0869286     1.91   0.056    -.0043068    .3364772
     dummy_4 |   .0416416   .0576324     0.72   0.470    -.0713257     .154609
     dummy_5 |   .2035991   .0654666     3.11   0.002     .0752755    .3319227
     dummy_6 |   .2259331    .068422     3.30   0.001     .0918165    .3600497
     dummy_7 |   .0051632   .0539573     0.10   0.924    -.1006004    .1109269
     dummy_8 |   .1418263   .0568291     2.50   0.013     .0304335    .2532192
     dummy_9 |   .0137466    .057465     0.24   0.811    -.0988927     .126386
    dummy_10 |   .0850276   .0578193     1.47   0.141    -.0283062    .1983614
    dummy_11 |   .1627831   .0677764     2.40   0.016      .029932    .2956342
    dummy_12 |   .0876861    .056251     1.56   0.119    -.0225737    .1979459
    dummy_13 |   .0904439   .0568916     1.59   0.112    -.0210715    .2019592
    dummy_14 |   .2491154   .0672213     3.71   0.000     .1173525    .3808783
    dummy_15 |   .1402449    .081626     1.72   0.086    -.0197534    .3002431
    dummy_16 |   .3226695   .0748107     4.31   0.000     .1760302    .4693088
    dummy_17 |   .1384198   .0655885     2.11   0.035     .0098573    .2669824
    dummy_18 |   .0990402    .078201     1.27   0.205    -.0542444    .2523249
    dummy_19 |   .1913801   .0757937     2.53   0.012      .042814    .3399462
    dummy_20 |   .2464223   .0771297     3.19   0.001     .0952375    .3976071
    dummy_21 |   .2330873   .0733906     3.18   0.001     .0892315     .376943
    dummy_22 |   .2123838   .0726213     2.92   0.003      .070036    .3547316
    dummy_23 |   .0992732   .0675491     1.47   0.142    -.0331323    .2316786
    dummy_24 |   .1593205   .0613348     2.60   0.009     .0390958    .2795452
    dummy_25 |   .2258911   .0650696     3.47   0.001     .0983457    .3534365
    dummy_26 |  -.0488521   .0671438    -0.73   0.467    -.1804631     .082759
    dummy_27 |   .2587467   .0583318     4.44   0.000     .1444083    .3730851
    dummy_28 |   .1164891   .0626196     1.86   0.063    -.0062539     .239232
    dummy_29 |   .1537655    .062229     2.47   0.013     .0317881     .275743
    dummy_30 |   .1649502   .0555775     2.97   0.003     .0560107    .2738897
    dummy_31 |   .0135066   .0639713     0.21   0.833    -.1118859     .138899
    dummy_32 |   .0688759   .0640557     1.08   0.282     -.056682    .1944338
    dummy_33 |   .0570972   .0642995     0.89   0.375    -.0689388    .1831331
    dummy_34 |   .1251616   .0601076     2.08   0.037     .0073425    .2429807
    dummy_35 |   .1908229   .0663556     2.88   0.004     .0607567    .3208891
    dummy_36 |  -.0009555   .0605731    -0.02   0.987    -.1196871     .117776
    dummy_37 |   .0825599   .0676738     1.22   0.222      -.05009    .2152099
    dummy_38 |   .2149651   .0550471     3.91   0.000     .1070652    .3228651
    dummy_39 |    .118504   .0773411     1.53   0.125    -.0330952    .2701031
    dummy_40 |   .1873323   .0727558     2.57   0.010     .0447209    .3299438
    dummy_41 |   .1281331   .0847728     1.51   0.131    -.0380333    .2942995
    dummy_42 |    .201984   .0694696     2.91   0.004     .0658141    .3381539
    dummy_43 |   .1100536   .0607856     1.81   0.070    -.0090945    .2292017
    dummy_44 |   .1388702   .0628791     2.21   0.027     .0156185     .262122
    dummy_45 |   .1100948   .0793462     1.39   0.165    -.0454345    .2656242
    dummy_46 |   .2640647    .064024     4.12   0.000     .1385689    .3895605
    dummy_47 |   .1601257   .0730316     2.19   0.028     .0169738    .3032777
    dummy_48 |   .1969698   .0675057     2.92   0.004     .0646494    .3292902
    dummy_49 |   .1673419   .0547774     3.05   0.002     .0599706    .2747132
    dummy_50 |   .1694679   .0782243     2.17   0.030     .0161376    .3227982
    dummy_51 |    .075541   .0785737     0.96   0.336    -.0784742    .2295563
      year_2 |  -.0159412   .0143141    -1.11   0.265    -.0439989    .0121164
      year_3 |   -.013834   .0134452    -1.03   0.304    -.0401884    .0125204
      year_4 |  -.0145897   .0148525    -0.98   0.326    -.0437026    .0145232
      year_5 |          0  (omitted)
      year_6 |  -.0157777   .0148822    -1.06   0.289    -.0449489    .0133934
       _cons |   .2911016   .0793889     3.67   0.000     .1354884    .4467149
------------------------------------------------------------------------------
. 
. /*The result is very similar to (iv) and (v) but it is bigger 
> iv      = 0.0468731 and significative
> v       = 0.0457252 and significative
> vi      = 0.0525387 and significative
>  */
. 
. * 7. Estimate a version of your model that allows the treatment effect to vary by those with 1 or 2+ children. Include all other vari
> ables as in (vi). Does the intervention seem to be more effective for one of these groups over the other? Why might this be the case 
> in the real world?
. 
. gen treat_1 = (children ==1)
. gen treat_2 = (children >= 2)
. 
. reg work post93##treat_1 post93##treat_2 urate nonwhite age ed unearn dummy_2-dummy_51 year_2-year_6, robust
note: year_6 omitted because of collinearity

Linear regression                               Number of obs     =     13,746
                                                F(64, 13681)      =      22.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1188
                                                Root MSE          =     .47032

--------------------------------------------------------------------------------
               |               Robust
          work |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      1.post93 |  -.0142827   .0195213    -0.73   0.464    -.0525472    .0239818
     1.treat_1 |  -.0549245   .0145201    -3.78   0.000     -.083386    -.026463
               |
post93#treat_1 |
          1 1  |   .0382126    .021188     1.80   0.071    -.0033187    .0797439
               |
     1.treat_2 |  -.1421333   .0130901   -10.86   0.000    -.1677918   -.1164749
               |
post93#treat_2 |
          1 1  |   .0606665   .0183489     3.31   0.001     .0247001     .096633
               |
         urate |   .0043008   .0073578     0.58   0.559    -.0101215    .0187231
      nonwhite |  -.0746108   .0097777    -7.63   0.000    -.0937765   -.0554451
           age |   .0030875   .0004342     7.11   0.000     .0022364    .0039385
            ed |   .0156214   .0016162     9.67   0.000     .0124535    .0187893
        unearn |  -.0170981   .0010924   -15.65   0.000    -.0192395   -.0149568
       dummy_2 |   .1033237   .0768187     1.35   0.179    -.0472515     .253899
       dummy_3 |   .1728452   .0868161     1.99   0.047     .0026736    .3430167
       dummy_4 |    .045054   .0578114     0.78   0.436    -.0682643    .1583723
       dummy_5 |   .2053744   .0654199     3.14   0.002     .0771424    .3336065
       dummy_6 |   .2278058   .0687351     3.31   0.001     .0930756    .3625361
       dummy_7 |   .0063473   .0541186     0.12   0.907    -.0997326    .1124272
       dummy_8 |   .1417242   .0569586     2.49   0.013     .0300775    .2533708
       dummy_9 |   .0119799   .0575985     0.21   0.835    -.1009211    .1248808
      dummy_10 |   .0902132   .0579678     1.56   0.120    -.0234115     .203838
      dummy_11 |   .1650269   .0679816     2.43   0.015     .0317737    .2982801
      dummy_12 |    .090071    .056394     1.60   0.110    -.0204689     .200611
      dummy_13 |   .0923942   .0570678     1.62   0.105    -.0194666    .2042549
      dummy_14 |   .2498871    .067169     3.72   0.000     .1182267    .3815475
      dummy_15 |     .14282   .0818986     1.74   0.081    -.0177125    .3033524
      dummy_16 |   .3213633   .0746812     4.30   0.000     .1749778    .4677488
      dummy_17 |   .1328016   .0658439     2.02   0.044     .0037386    .2618646
      dummy_18 |   .0990539    .078625     1.26   0.208    -.0550619    .2531698
      dummy_19 |   .1901845   .0761091     2.50   0.012     .0410002    .3393688
      dummy_20 |   .2503684    .077612     3.23   0.001     .0982381    .4024986
      dummy_21 |   .2348806   .0734386     3.20   0.001     .0909308    .3788304
      dummy_22 |   .2048544   .0727221     2.82   0.005     .0623091    .3473997
      dummy_23 |   .1010131   .0677167     1.49   0.136    -.0317209    .2337472
      dummy_24 |   .1580277   .0614961     2.57   0.010     .0374869    .2785685
      dummy_25 |   .2251599   .0651036     3.46   0.001     .0975479     .352772
      dummy_26 |  -.0438502   .0673204    -0.65   0.515    -.1758073     .088107
      dummy_27 |    .255649    .058501     4.37   0.000     .1409789    .3703191
      dummy_28 |   .1177395   .0627162     1.88   0.060    -.0051928    .2406718
      dummy_29 |    .154036   .0624475     2.47   0.014     .0316303    .2764418
      dummy_30 |   .1656377    .055709     2.97   0.003     .0564404     .274835
      dummy_31 |   .0108981   .0642013     0.17   0.865    -.1149453    .1367415
      dummy_32 |   .0721568   .0642313     1.12   0.261    -.0537455     .198059
      dummy_33 |    .057467   .0643691     0.89   0.372    -.0687053    .1836392
      dummy_34 |   .1294011   .0602981     2.15   0.032     .0112086    .2475936
      dummy_35 |   .1907311   .0665218     2.87   0.004     .0603392    .3211231
      dummy_36 |   .0004211   .0606452     0.01   0.994    -.1184519    .1192941
      dummy_37 |   .0806016   .0676564     1.19   0.234    -.0520142    .2132175
      dummy_38 |   .2152433   .0552223     3.90   0.000         .107    .3234867
      dummy_39 |   .1240456   .0780522     1.59   0.112    -.0289474    .2770386
      dummy_40 |   .1874872   .0728419     2.57   0.010     .0447072    .3302673
      dummy_41 |   .1291903   .0853323     1.51   0.130    -.0380728    .2964534
      dummy_42 |   .2025725   .0694243     2.92   0.004     .0664914    .3386536
      dummy_43 |   .1143566   .0608586     1.88   0.060    -.0049347    .2336479
      dummy_44 |   .1426871   .0629483     2.27   0.023     .0192998    .2660745
      dummy_45 |   .1160791   .0792189     1.47   0.143    -.0392009    .2713591
      dummy_46 |   .2686022   .0640564     4.19   0.000     .1430429    .3941614
      dummy_47 |   .1606497   .0730758     2.20   0.028     .0174112    .3038882
      dummy_48 |   .1955347   .0674796     2.90   0.004     .0632655     .327804
      dummy_49 |   .1680438   .0549251     3.06   0.002     .0603831    .2757045
      dummy_50 |   .1665074   .0787446     2.11   0.034     .0121573    .3208576
      dummy_51 |   .0814156   .0793827     1.03   0.305    -.0741854    .2370166
        year_2 |  -.0150422   .0142983    -1.05   0.293    -.0430688    .0129845
        year_3 |   -.013112   .0134069    -0.98   0.328    -.0393914    .0131674
        year_4 |   .0019095    .015355     0.12   0.901    -.0281885    .0320074
        year_5 |   .0160153   .0148799     1.08   0.282    -.0131513    .0451819
        year_6 |          0  (omitted)
         _cons |    .295789   .0794692     3.72   0.000     .1400184    .4515596
--------------------------------------------------------------------------------
. 
. /*The results for those with 2+ children (0.0606665) are bigger than for thoses with only 1 child (0.0382126). */
. 
. * 8. Estimate a “placebo” treatment model as follows: Take data from only the pre-reform period (up to and including 1993). Drop the 
> rest, or restrict your model to run only if year <= 1993. Estimate the effect for all affected women together, just as in (vi). Intro
> duce a placebo policy that begins in 1992 (so 1992 and 1993 are both “treated” with this fake policy). What do you find? Are your res
> ults “reassuring”?
. 
. gen placebo = (year == 1992 | year == 1993)
. 
. 
. reg work placebo##anykids urate nonwhite age ed unearn dummy_2-dummy_51 year_2 if year <=1993, robust

Linear regression                               Number of obs     =      7,401
                                                F(59, 7341)       =      14.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1223
                                                Root MSE          =     .47035

---------------------------------------------------------------------------------
                |               Robust
           work |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
      1.placebo |  -.0045778   .0190717    -0.24   0.810    -.0419638    .0328083
      1.anykids |  -.0937041   .0194682    -4.81   0.000    -.1318675   -.0555408
                |
placebo#anykids |
           1 1  |  -.0176641   .0233317    -0.76   0.449    -.0634009    .0280726
                |
          urate |   .0087989   .0110116     0.80   0.424     -.012787    .0303847
       nonwhite |  -.0761902   .0132054    -5.77   0.000    -.1020765   -.0503038
            age |   .0034422   .0005892     5.84   0.000     .0022872    .0045971
             ed |   .0138963   .0022082     6.29   0.000     .0095677     .018225
         unearn |  -.0180049   .0014534   -12.39   0.000    -.0208539   -.0151558
        dummy_2 |   .1130245   .0972732     1.16   0.245    -.0776589    .3037078
        dummy_3 |   .0471414    .106867     0.44   0.659    -.1623487    .2566315
        dummy_4 |  -.0440975   .0736257    -0.60   0.549    -.1884251      .10023
        dummy_5 |   .1361139   .0889936     1.53   0.126    -.0383392     .310567
        dummy_6 |   .2003696   .0891348     2.25   0.025     .0256398    .3750994
        dummy_7 |  -.0450589   .0692222    -0.65   0.515    -.1807543    .0906365
        dummy_8 |   .0907183   .0723127     1.25   0.210    -.0510353     .232472
        dummy_9 |  -.0292569   .0736752    -0.40   0.691    -.1736815    .1151677
       dummy_10 |   .0450593   .0742883     0.61   0.544    -.1005671    .1906857
       dummy_11 |   .1049924    .087107     1.21   0.228    -.0657624    .2757472
       dummy_12 |   .0151388   .0720456     0.21   0.834    -.1260913    .1563689
       dummy_13 |   .0325196   .0739307     0.44   0.660    -.1124058     .177445
       dummy_14 |   .2081427   .0874292     2.38   0.017     .0367563    .3795291
       dummy_15 |   .0789152     .10845     0.73   0.467     -.133678    .2915083
       dummy_16 |   .2738064   .0991596     2.76   0.006     .0794251    .4681878
       dummy_17 |   .0649236   .0840217     0.77   0.440     -.099783    .2296302
       dummy_18 |   .0242529   .1014502     0.24   0.811    -.1746187    .2231245
       dummy_19 |   .1793348   .1013471     1.77   0.077    -.0193346    .3780043
       dummy_20 |   .2129441   .1144173     1.86   0.063    -.0113467     .437235
       dummy_21 |   .2316603   .0933566     2.48   0.013     .0486544    .4146661
       dummy_22 |    .192303   .0933061     2.06   0.039     .0093962    .3752098
       dummy_23 |  -.0412752   .0931636    -0.44   0.658    -.2239026    .1413522
       dummy_24 |   .0705658   .0794507     0.89   0.374    -.0851803    .2263119
       dummy_25 |   .1263333   .0879716     1.44   0.151    -.0461162    .2987829
       dummy_26 |  -.1804771   .0921103    -1.96   0.050    -.3610398    .0000856
       dummy_27 |   .2134651   .0753908     2.83   0.005     .0656775    .3612528
       dummy_28 |  -.0278731   .0810067    -0.34   0.731    -.1866695    .1309232
       dummy_29 |   .0885069   .0847918     1.04   0.297    -.0777095    .2547232
       dummy_30 |   .1223574   .0715804     1.71   0.087    -.0179606    .2626755
       dummy_31 |  -.1046754   .0828845    -1.26   0.207    -.2671527     .057802
       dummy_32 |  -.0346331   .0830625    -0.42   0.677    -.1974595    .1281932
       dummy_33 |   .0569341   .0868668     0.66   0.512    -.1133498     .227218
       dummy_34 |   .0677779   .0787909     0.86   0.390     -.086675    .2222307
       dummy_35 |   .0782622   .0873324     0.90   0.370    -.0929345    .2494589
       dummy_36 |  -.1248451   .0787002    -1.59   0.113    -.2791201    .0294298
       dummy_37 |   .0444888   .0901723     0.49   0.622    -.1322748    .2212524
       dummy_38 |   .1405744    .070898     1.98   0.047      .001594    .2795548
       dummy_39 |   .0820212   .0982538     0.83   0.404    -.1105846    .2746269
       dummy_40 |   .1429748   .0976137     1.46   0.143    -.0483761    .3343257
       dummy_41 |  -.0051831   .1195446    -0.04   0.965    -.2395248    .2291586
       dummy_42 |    .153032   .0947232     1.62   0.106    -.0326527    .3387167
       dummy_43 |   .0287553   .0838017     0.34   0.732      -.13552    .1930306
       dummy_44 |    .047298   .0869059     0.54   0.586    -.1230626    .2176585
       dummy_45 |   .0947826   .1046942     0.91   0.365    -.1104482    .3000133
       dummy_46 |   .2100233   .0822984     2.55   0.011     .0486948    .3713519
       dummy_47 |   .1208805   .0959568     1.26   0.208    -.0672224    .3089834
       dummy_48 |   .0945814   .0892011     1.06   0.289    -.0802784    .2694411
       dummy_49 |   .1001734   .0701537     1.43   0.153     -.037348    .2376947
       dummy_50 |   .0745366    .099758     0.75   0.455    -.1210177    .2700909
       dummy_51 |   .0538041   .1083018     0.50   0.619    -.1584986    .2661068
         year_2 |  -.0041643   .0150133    -0.28   0.782    -.0335948    .0252662
          _cons |    .328841   .1109985     2.96   0.003     .1112521    .5464299
---------------------------------------------------------------------------------
. 
. /* The placebo treatment doesn't appear to affect the employment before the reform period of 1993 */
. 
. log close
      name:  <unnamed>
       log:  D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD\PS_DiD_Calv
> o_Ibañez_Nuñez_Soto_P2-2023-06-30_1.log
  log type:  text
 closed on:  30 Jun 2023, 19:05:43
---------------------------------------------------------------------------------------------------------------------------------------
