---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\1. Documentos\0. Bases de datos\0. Dofiles y Scripts\Diplomado_PUCP\Econometría Avanzada Aplicada\Problem set Diff in D
> iff\PS_DiD_Calvo_Ibañez_Nuñez_Soto-2023-06-29_1.log
  log type:  text
 opened on:  29 Jun 2023, 17:41:24

.         local today "`c(current_time)'"

.         local curdir "`c(pwd)'"

.         local newn = c(N) + 1

. 
. 
. /*******************************************************************************
> Problem 1 - Descarga de datos
> *******************************************************************************/
. * Insertar aquí la dirección donde se almacena la data
. 
. global bd "D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD"

. {
. cd "$bd"
D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD
. global year "96 97 98 99 00 01 02 03 04 05 06"
. foreach yy of global year {
  2. 
. if `yy'==96 | `yy'==97 | `yy'==98 | `yy'==99 {
  3. shell curl -o cbp`yy'st.zip "https://www2.census.gov/programs-surveys/cbp/datasets/19`yy'/cbp`yy'st.zip"
  4. }
  5. else if `yy'!=96 & `yy'!=97 & `yy'!=98 & `yy'!=99 {
  6. shell curl -o cbp`yy'st.zip "https://www2.census.gov/programs-surveys/cbp/datasets/20`yy'/cbp`yy'st.zip"
  7. }
  8. unzipfile cbp`yy'st.zip, replace
  9. import delimited "cbp`yy'st.txt", clear
 10. 
. if `yy'==96 | `yy'==97 {
 11. rename sic naics
 12. }
 13. else {
 14. }
 15. 
. keep if substr(naics,4,3)=="///"
 16. * keeping all 3-digit manufacturing sector
. /*keep if naics=="311///" | naics=="312///" | naics=="313///" | naics=="314///" | naics=="315///" | naics=="316///" | naics=="321///"
>  | naics=="322///" | naics=="323///" | naics=="324///" | naics=="325///" | naics=="326///" | naics=="327///" | naics=="331///" | naic
> s=="332///" | naics=="333//" | naics=="334///" | naics=="335///" | naics=="336///" | naics=="337///" | naics=="339///" */
. 
. keep fipstate naics emp qp1 ap est
 17. if `yy'==96 | `yy'==97 | `yy'==98 | `yy'==99 {
 18.         gen year=19`yy' 
 19. }
 20. else if `yy'!=96 | `yy'!=97 | `yy'!=98 | `yy'!=99 {
 21.         gen year=20`yy' 
 22. }
 23. save cbp`yy'st.dta, replace
 24. }
    inflating: cbp96st.txt

successfully unzipped cbp96st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 49,942 obs)
(49,942 observations deleted)
(note: dataset contains 0 observations)
file cbp96st.dta saved
    inflating: cbp97st.txt

successfully unzipped cbp97st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 49,988 obs)
(49,988 observations deleted)
(note: dataset contains 0 observations)
file cbp97st.dta saved
    inflating: cbp98st.txt

successfully unzipped cbp98st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 98,103 obs)
(93,910 observations deleted)
file cbp98st.dta saved
    inflating: cbp99st.txt

successfully unzipped cbp99st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 98,488 obs)
(94,293 observations deleted)
file cbp99st.dta saved
    inflating: Cbp00st.txt

successfully unzipped cbp00st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 98,550 obs)
(94,352 observations deleted)
file cbp00st.dta saved
    inflating: cbp01st.txt

successfully unzipped cbp01st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 98,672 obs)
(94,470 observations deleted)
file cbp01st.dta saved
    inflating: cbp02st.txt

successfully unzipped cbp02st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 98,452 obs)
(94,250 observations deleted)
file cbp02st.dta saved
    inflating: cbp03st.txt

successfully unzipped cbp03st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 99,290 obs)
(94,882 observations deleted)
file cbp03st.dta saved
    inflating: cbp04st.txt

successfully unzipped cbp04st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 99,178 obs)
(94,773 observations deleted)
file cbp04st.dta saved
    inflating: cbp05st.txt

successfully unzipped cbp05st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 99,126 obs)
(94,723 observations deleted)
file cbp05st.dta saved
    inflating: cbp06st.txt

successfully unzipped cbp06st.zip to current directory
total processed:  1
        skipped:  0
      extracted:  1
(53 vars, 99,082 obs)
(94,682 observations deleted)
file cbp06st.dta saved
. 
. use cbp98st.dta, clear 
. append using cbp99st.dta 
. append using cbp00st.dta 
. append using cbp01st.dta 
. append using cbp02st.dta 
. append using cbp03st.dta
. append using cbp04st.dta 
. append using cbp05st.dta
. append using cbp06st.dta 
. 
. save "$bd/data_problem1.dta", replace
file D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD/data_problem1.dta s
> aved
. }

. /*******************************************************************************
> Problem 1 - Respuestas
> *******************************************************************************/
. 
. use "$bd/data_problem1.dta", clear

. 
. * 1. What is the level of observation?
. 
. isid fipstate naics year        /// Each observation correspond to a sector i in the state j at the year t.
> 

. * 2. Construct 1 dummy variable called “post_china” where post_china=1 for year>=2001 and 0 otherwise. 
. 
. gen post_china = (year>=2001)

. 
. tab year post_china     /* We can verify that the dummy variable was created*/

           |      post_china
      year |         0          1 |     Total
-----------+----------------------+----------
      1998 |     4,193          0 |     4,193 
      1999 |     4,195          0 |     4,195 
      2000 |     4,198          0 |     4,198 
      2001 |         0      4,202 |     4,202 
      2002 |         0      4,202 |     4,202 
      2003 |         0      4,408 |     4,408 
      2004 |         0      4,405 |     4,405 
      2005 |         0      4,403 |     4,403 
      2006 |         0      4,400 |     4,400 
-----------+----------------------+----------
     Total |    12,586     26,020 |    38,606 

. 
. * 3. Construct 1 dummy variable called “manuf” where manuf=1 for all the observations that start with naics code “3” – which is manuf
> acturing - and 0 otherwise. 
. 
. gen fl_naics = substr(naics,1,1)        /// First, we extract the first letter of naics
> 

. gen manuf = (fl_naics == "3")           /// Secong, we generate the dummy variable manuf
> 

. tab fl_naics manuf      /* We can verify that the dummy variable was created*/

           |         manuf
  fl_naics |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,352          0 |     1,352 
         2 |     3,185          0 |     3,185 
         3 |         0      9,584 |     9,584 
         4 |    10,730          0 |    10,730 
         5 |     7,788          0 |     7,788 
         6 |     2,295          0 |     2,295 
         7 |     2,295          0 |     2,295 
         8 |     1,377          0 |     1,377 
-----------+----------------------+----------
     Total |    29,022      9,584 |    38,606 

. 
. * 4. Construct the values necessary to generate the difference-in-difference estimate (i.e. 2x2 Matrix) of the effect of China enteri
> ng the WTO on employment (emp). 
. 
. * First we calculate the means of every group (T and C) for each year (Pre and Post)
. mean emp, over(post_china manuf)

Mean estimation                             Number of obs   =     38,606

------------------------------------------------------------------------
                       |       Mean   Std. Err.     [95% Conf. Interval]
-----------------------+------------------------------------------------
c.emp@post_china#manuf |
                  0 0  |   29539.34   658.8515      28247.98    30830.71
                  0 1  |   15619.13   470.3188      14697.29    16540.96
                  1 0  |   30579.65     495.36      29608.73    31550.57
                  1 1  |   13366.85   278.3781      12821.22    13912.48
------------------------------------------------------------------------

. 
. * Now, we store results in a 1x4 matrix 
. matrix define did_matrix = e(b)

. 
. * Finally, we calculate the DiD estimate by doing the doble difference of means
. scalar did_estimate = (did_matrix[1,4] - did_matrix[1,2]) - (did_matrix[1,3] - did_matrix[1,1])

. 
. /* The results of the DiD estimate is -3292.5804, which means that the effect of 
> China entering to the WTO in 2001 over employment in manufacture was a loss in 
> employment of 3292 jobs.*/
. 
. * 5. Estimate a diff-in-diff regression and make sure you get the same diff-in-diff estimate as in part 4.
. 
. /* Now we estimate the DiD regression and we obtain the same result in part 4. 
> But here we can notice that the coefficient is significant.*/
. reg emp post_china##manuf , robust

Linear regression                               Number of obs     =     38,606
                                                F(3, 38602)       =     417.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0135
                                                Root MSE          =      59847

----------------------------------------------------------------------------------
                 |               Robust
             emp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    1.post_china |   1040.306   824.3048     1.26   0.207    -575.3529    2655.964
         1.manuf |  -13920.22   809.4674   -17.20   0.000    -15506.79   -12333.64
                 |
post_china#manuf |
            1 1  |   -3292.58   989.0006    -3.33   0.001    -5231.047   -1354.114
                 |
           _cons |   29539.34   658.8505    44.83   0.000     28247.98    30830.71
----------------------------------------------------------------------------------

. 
. 
. * 6. Estimate a diff-in-diff regression for the effect of China entering the WTO in 2001 on the number of establishment (est), an ave
> rage pay (qp1/emp). Interpret the results. 
. 
. /* We estimate the effect of China entering WTO over the number of establishments
> in manufacture sector. The DiD estimate is not significant. */
. reg est post_china##manuf , robust

Linear regression                               Number of obs     =     38,606
                                                F(3, 38602)       =    1245.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0320
                                                Root MSE          =     4247.8

----------------------------------------------------------------------------------
                 |               Robust
             est |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    1.post_china |   34.06917   59.87989     0.57   0.569    -83.29693    151.4353
         1.manuf |  -1753.077   49.38144   -35.50   0.000    -1849.866   -1656.289
                 |
post_china#manuf |
            1 1  |  -52.57497   61.31209    -0.86   0.391    -172.7482    67.59828
                 |
           _cons |    2091.31   48.13563    43.45   0.000     1996.963    2185.657
----------------------------------------------------------------------------------

. 
. * We generate the variable average payment
. gen av_pay = qp1/emp
(5,598 missing values generated)

. 
. /* We estimate the effect of China entering WTO over the average payment in manu
> facture sector. The DiD estimate is -215 dollars in quarterly average payment.*/
. reg av_pay post_china##manuf , robust

Linear regression                               Number of obs     =     33,008
                                                F(3, 33004)       =     377.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0215
                                                Root MSE          =     5.0293

----------------------------------------------------------------------------------
                 |               Robust
          av_pay |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    1.post_china |   1.469355   .0713974    20.58   0.000     1.329413    1.609296
         1.manuf |   .9393528   .0733652    12.80   0.000     .7955544    1.083151
                 |
post_china#manuf |
            1 1  |  -.2149973   .0950952    -2.26   0.024    -.4013873   -.0286072
                 |
           _cons |   7.134095   .0548974   129.95   0.000     7.026494    7.241696
----------------------------------------------------------------------------------

. 
. * 7. Estimate same regression as in (5) but now take logs of the dependent variable (i,e, log(emp)). Interpret your results. Is it ne
> cessary to take logs?
. 
. * We generate the variable natural logarithm of employment
. gen ln_emp = ln(emp)
(5,598 missing values generated)

. 
. /* We estimate the DiD regression of the new variable. The result is that the effect
> of China entering WTO over employment is a decrease of 16.7% of the level of employment
>  in manufacture sector. */
. reg ln_emp post_china##manuf , robust

Linear regression                               Number of obs     =     33,008
                                                F(3, 33004)       =     323.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0264
                                                Root MSE          =       1.64

----------------------------------------------------------------------------------
                 |               Robust
          ln_emp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    1.post_china |  -.0338726   .0227347    -1.49   0.136    -.0784335    .0106883
         1.manuf |  -.4957951   .0340977   -14.54   0.000    -.5626278   -.4289625
                 |
post_china#manuf |
            1 1  |  -.1672472   .0418857    -3.99   0.000    -.2493448   -.0851496
                 |
           _cons |   9.369065   .0186086   503.48   0.000     9.332592    9.405538
----------------------------------------------------------------------------------

. 
. /* To proof that it is necessary to use logarithm we need to verify the distribu
> tion of employment. In order to do that, we plot two histogram graphs of empleyment 
> in levels and in logarithm. */
. histogram emp if manuf==1, percent fcolor(yellow) legend(label (1 "Manufacture")) addplot(histogram emp if manuf != 1, percent fcolor
> (blue) ///
> legend(label (2 "Others"))) saving(hist1, replace)
(bin=39, start=0, width=9848.1282)
(note: file hist1.gph not found)
(file hist1.gph saved)

.   
. histogram ln_emp if manuf==1, percent fcolor(yellow) legend(label (1 "Manufacture")) addplot(histogram ln_emp  if manuf != 1, percent
>  fcolor(blue) ///
> legend(label (2 "Others"))) saving(hist2, replace)
(bin=39, start=1.7917595, width=.28376511)
(note: file hist2.gph not found)
(file hist2.gph saved)

. 
. /*In this graph we can notice that the employment in levels is not normally distri
> buted*; but the log employment is more near to be a normal distribution. */
. graph combine hist1.gph hist2.gph

. 
. 
. * 8. Generate one dummy per year. Construct the interaction between each year dummies and your treatment group (manuf). You should ha
> ve 9 interaction terms. 
. 
. egen dummy_year = group(year)

. tabulate year, generate(dummy_)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1998 |      4,193       10.86       10.86
       1999 |      4,195       10.87       21.73
       2000 |      4,198       10.87       32.60
       2001 |      4,202       10.88       43.49
       2002 |      4,202       10.88       54.37
       2003 |      4,408       11.42       65.79
       2004 |      4,405       11.41       77.20
       2005 |      4,403       11.40       88.60
       2006 |      4,400       11.40      100.00
------------+-----------------------------------
      Total |     38,606      100.00

. 
. foreach year of numlist 1/9 {
  2. gen dummy_`year'_manuf = dummy_`year' * manuf 
  3. }

. 
. 
. * 9. Estimate an event study
. 
. reghdfe ln_emp dummy_2-dummy_9 dummy_2_manuf-dummy_9_manuf, absorb(naics fipstate)
(dropped 1 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     33,007
Absorbing 2 HDFE groups                           F(  16,  32848) =      22.40
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8579
                                                  Adj R-squared   =     0.8572
                                                  Within R-sq.    =     0.0108
                                                  Root MSE        =     0.6281

-------------------------------------------------------------------------------
       ln_emp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dummy_2 |   .0502677   .0173284     2.90   0.004     .0163033    .0842321
      dummy_3 |   .0633564   .0172749     3.67   0.000     .0294969    .0972158
      dummy_4 |   .0857459   .0172705     4.96   0.000     .0518951    .1195967
      dummy_5 |   .0589551   .0171121     3.45   0.001     .0254148    .0924954
      dummy_6 |   .1107917   .0172565     6.42   0.000     .0769684     .144615
      dummy_7 |   .1286211   .0172793     7.44   0.000     .0947532    .1624891
      dummy_8 |   .1383452     .01726     8.02   0.000      .104515    .1721755
      dummy_9 |   .1744989   .0172974    10.09   0.000     .1405954    .2084024
dummy_2_manuf |  -.0534234    .033976    -1.57   0.116    -.1200176    .0131709
dummy_3_manuf |  -.0990023   .0337549    -2.93   0.003     -.165163   -.0328416
dummy_4_manuf |  -.1382501   .0337981    -4.09   0.000    -.2044957   -.0720045
dummy_5_manuf |  -.1971957   .0338537    -5.82   0.000    -.2635502   -.1308412
dummy_6_manuf |  -.3471332   .0335803   -10.34   0.000    -.4129518   -.2813147
dummy_7_manuf |  -.3527959   .0337383   -10.46   0.000    -.4189242   -.2866677
dummy_8_manuf |  -.3697484   .0337071   -10.97   0.000    -.4358156   -.3036812
dummy_9_manuf |  -.4183103   .0337341   -12.40   0.000    -.4844303   -.3521902
        _cons |   9.155804   .0105189   870.41   0.000     9.135187    9.176422
-------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       naics |        93           0          93     |
    fipstate |        51           1          50     |
-----------------------------------------------------+

. 
. coefplot, keep(dummy_2_manuf dummy_3_manuf dummy_4_manuf dummy_5_manuf dummy_6_manuf dummy_7_manuf dummy_8_manuf dummy_9_manuf)      
>                ///
>           coeflabels(dummy_2_manuf = "1999"                                                                                          
>            ///
>                      dummy_3_manuf = "2000"                                                                                          
>            ///
>                      dummy_4_manuf  = "2001"                                                                                         
>    ///
>                      dummy_5_manuf  = "2002"                                                                                         
>    ///
>                      dummy_6_manuf  = "2003"                                                                                         
>    ///
>                      dummy_7_manuf  = "2004"                                                                            ///
>                      dummy_8_manuf  = "2005"                                                                                         
>    ///
>                                          dummy_9_manuf  = "2006")                                                                    
>    ///
>           vertical                                                                          ///
>           yline(0)                                                                          ///
>           ytitle("Log points")                                                              ///
>           xtitle("Year") ///
>           addplot(line @b @at)                                                              ///
>           ciopts(recast(rcap))                                                              ///
>           rescale(100)                                                                      ///
>           scheme(s1mono) 

.                   
. graph export "$bd/Coefplot_1.png", replace
(note: file D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD/Coefplot_1.p
> ng not found)
(file D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD/Coefplot_1.png wri
> tten in PNG format)

. 
. /*As shown in the graph, the effects of China entering the WTO are persistent even
>  after 5 years of the beggining of the effect. But we have to notice that the effect 
>  also was significant at the year 2000, so it may be the case that even one year
>  before the entering to WTO this had a effect previous to be done.*/
. 
. * 10. Estimate a similar event study on the log(est) and average pay. Interpret your results
.  
. * Generate the logarithm of establishment variable and event study for the log of number of establishments 
.  
.  gen ln_est = ln(est)

.  
. reghdfe ln_est dummy_2-dummy_9 dummy_2_manuf-dummy_9_manuf, absorb(naics fipstate)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     38,606
Absorbing 2 HDFE groups                           F(  16,  38446) =       7.80
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9213
                                                  Adj R-squared   =     0.9210
                                                  Within R-sq.    =     0.0032
                                                  Root MSE        =     0.5743

-------------------------------------------------------------------------------
       ln_est |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dummy_2 |   .0121746   .0145206     0.84   0.402    -.0162862    .0406354
      dummy_3 |   .0291387   .0145172     2.01   0.045     .0006847    .0575927
      dummy_4 |   .0463701   .0145127     3.20   0.001     .0179249    .0748153
      dummy_5 |   .0690701   .0145138     4.76   0.000     .0406228    .0975175
      dummy_6 |   .0798299   .0145544     5.48   0.000     .0513029     .108357
      dummy_7 |   .0884799   .0145578     6.08   0.000     .0599462    .1170135
      dummy_8 |   .1006556   .0145588     6.91   0.000       .07212    .1291913
      dummy_9 |   .1096713   .0145611     7.53   0.000     .0811313    .1382114
dummy_2_manuf |  -.0060671   .0288086    -0.21   0.833    -.0625327    .0503985
dummy_3_manuf |  -.0294689   .0288069    -1.02   0.306    -.0859312    .0269934
dummy_4_manuf |  -.0354165   .0288046    -1.23   0.219    -.0918743    .0210414
dummy_5_manuf |  -.1000633   .0288002    -3.47   0.001    -.1565123   -.0436142
dummy_6_manuf |  -.1067031   .0288257    -3.70   0.000    -.1632022    -.050204
dummy_7_manuf |  -.1230202   .0288274    -4.27   0.000    -.1795227   -.0665178
dummy_8_manuf |  -.1547169    .028833    -5.37   0.000    -.2112302   -.0982035
dummy_9_manuf |  -.1618097   .0288392    -5.61   0.000    -.2183353   -.1052841
        _cons |   5.742545   .0089218   643.65   0.000     5.725058    5.760032
-------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       naics |        94           0          94     |
    fipstate |        51           1          50     |
-----------------------------------------------------+

. 
. coefplot, keep(dummy_2_manuf dummy_3_manuf dummy_4_manuf dummy_5_manuf dummy_6_manuf dummy_7_manuf dummy_8_manuf dummy_9_manuf)      
>                ///
>           coeflabels(dummy_2_manuf = "1999"                                                                                          
>            ///
>                      dummy_3_manuf = "2000"                                                                                          
>            ///
>                      dummy_4_manuf  = "2001"                                                                                         
>    ///
>                      dummy_5_manuf  = "2002"                                                                                         
>    ///
>                      dummy_6_manuf  = "2003"                                                                                         
>    ///
>                      dummy_7_manuf  = "2004"                                                                            ///
>                      dummy_8_manuf  = "2005"                                                                                         
>    ///
>                                          dummy_9_manuf  = "2006")                                                                    
>    ///
>           vertical                                                                          ///
>           yline(0)                                                                          ///
>           ytitle("Log points")                                                              ///
>           xtitle("Year") ///
>           addplot(line @b @at)                                                              ///
>           ciopts(recast(rcap))                                                              ///
>           rescale(100)                                                                      ///
>           scheme(s1mono) 

.                   
. graph export "$bd/Coefplot_2.png", replace
(file D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD/Coefplot_2.png wri
> tten in PNG format)

.  
. /*As shown in the graph, the effects of China entering the WTO over the quantity 
> of stablishments are negative, significant and persistent. The quantity of establishments 
> reduced between 10% and 15% because the China's entry to the WTO. Also, we can notice that
> the effects are bigger for 2005 and 2006. And we can notice that there are
> no significant effects for the previous period (1998-2000).*/ 
. 
. * Generate the logarithm of average payment and event study for the log of average payment
. 
. gen ln_av_pay = ln(av_pay)
(5,598 missing values generated)

. 
. reghdfe ln_av_pay dummy_2-dummy_9 dummy_2_manuf-dummy_9_manuf, absorb(naics fipstate)
(dropped 1 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     33,007
Absorbing 2 HDFE groups                           F(  16,  32848) =     457.99
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8731
                                                  Adj R-squared   =     0.8725
                                                  Within R-sq.    =     0.1824
                                                  Root MSE        =     0.1792

-------------------------------------------------------------------------------
    ln_av_pay |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dummy_2 |    .038851   .0049437     7.86   0.000     .0291612    .0485408
      dummy_3 |   .1091364   .0049284    22.14   0.000     .0994765    .1187963
      dummy_4 |   .1586566   .0049272    32.20   0.000     .1489992    .1683141
      dummy_5 |   .1715755    .004882    35.14   0.000     .1620066    .1811443
      dummy_6 |   .1803794   .0049232    36.64   0.000     .1707298     .190029
      dummy_7 |   .2055768   .0049297    41.70   0.000     .1959145    .2152392
      dummy_8 |   .2326716   .0049242    47.25   0.000       .22302    .2423232
      dummy_9 |   .3055536   .0049348    61.92   0.000     .2958811    .3152261
dummy_2_manuf |  -.0120927   .0096932    -1.25   0.212    -.0310916    .0069063
dummy_3_manuf |  -.0065991   .0096301    -0.69   0.493    -.0254744    .0122762
dummy_4_manuf |  -.0279278   .0096424    -2.90   0.004    -.0468273   -.0090283
dummy_5_manuf |  -.0196684   .0096583    -2.04   0.042     -.038599   -.0007379
dummy_6_manuf |  -.0131372   .0095803    -1.37   0.170    -.0319149    .0056404
dummy_7_manuf |  -.0125553   .0096253    -1.30   0.192    -.0314214    .0063107
dummy_8_manuf |  -.0213005   .0096165    -2.22   0.027    -.0401491   -.0024519
dummy_9_manuf |  -.0295589   .0096241    -3.07   0.002    -.0484226   -.0106952
        _cons |   1.835007    .003001   611.47   0.000     1.829125    1.840889
-------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       naics |        93           0          93     |
    fipstate |        51           1          50     |
-----------------------------------------------------+

. 
. coefplot, keep(dummy_2_manuf dummy_3_manuf dummy_4_manuf dummy_5_manuf dummy_6_manuf dummy_7_manuf dummy_8_manuf dummy_9_manuf)      
>                ///
>           coeflabels(dummy_2_manuf = "1999"                                                                                          
>            ///
>                      dummy_3_manuf = "2000"                                                                                          
>            ///
>                      dummy_4_manuf  = "2001"                                                                                         
>    ///
>                      dummy_5_manuf  = "2002"                                                                                         
>    ///
>                      dummy_6_manuf  = "2003"                                                                                         
>    ///
>                      dummy_7_manuf  = "2004"                                                                            ///
>                      dummy_8_manuf  = "2005"                                                                                         
>    ///
>                                          dummy_9_manuf  = "2006")                                                                    
>    ///
>           vertical                                                                          ///
>           yline(0)                                                                          ///
>           ytitle("Log points")                                                              ///
>           xtitle("Year") ///
>           addplot(line @b @at)                                                              ///
>           ciopts(recast(rcap))                                                              ///
>           rescale(100)                                                                      ///
>           scheme(s1mono) 

.                   
. graph export "$bd/Coefplot_3.png", replace
(file D:\1. Documentos\1. Estudios\7. Diplomado PUCP Data Science\06. Econometría Aplicada Avanzada\1. Data\PS - DiD/Coefplot_3.png wri
> tten in PNG format)

. 
. /*As shown in the graph, the effect of China entering the WTO over the average 
> payment is negative and significant in 2001, 2002, 2005 and 2006; but not significant
> for 2003 and 2004. */
. 
. log close
      name:  <unnamed>
       log:  D:\1. Documentos\0. Bases de datos\0. Dofiles y Scripts\Diplomado_PUCP\Econometría Avanzada Aplicada\Problem set Diff in D
> iff\PS_DiD_Calvo_Ibañez_Nuñez_Soto-2023-06-29_1.log
  log type:  text
 closed on:  29 Jun 2023, 17:42:03
---------------------------------------------------------------------------------------------------------------------------------------
